InformationRegisters/НастройкиАдресныхСкладов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>НастройкиАдресныхСкладов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГлубинаАнализа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МинимальнаяВероятностьОтгрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УровеньОбслуживанияУпаковокКлассаX</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УровниОбслуживания</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УровеньОбслуживанияУпаковокКлассаY</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УровниОбслуживания</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УровеньОбслуживанияУпаковокКлассаZ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УровниОбслуживания</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьПрогнозРасходаУпаковок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегламентноеЗаданиеРасчетаПоказателейПрогноза</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьАдресноеХранение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьАдресноеХранениеСправочно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьРабочиеУчастки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьРегламентноеЗаданиеСозданиеЗаданийНаПодпитку</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегламентноеЗаданиеСозданиеЗаданийНаОтбор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьИспользоватьРегламентноеЗаданиеСозданияЗаданийНаПодпитку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьРегламентноеЗаданиеСозданияЗаданийНаОтбор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаФормированияПоРабочимУчасткамОтбор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОграничиватьПоВесуОтбор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОграничиватьПоОбъемуОтбор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОграничениеПоОбъемуОтбор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОграничениеПоВесуОтбор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РабочийУчастокОтбор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеУчастки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаАдресногоХраненияОстатков</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегламентныеЗаданияСозданияЗаданийНаПересчетТоваров</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегламентныеЗаданияСозданияЗаданийНаПеремещение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеПомещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ИспользованиеСкладскихРабочихУчастков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ИспользованиеСкладскихРабочихУчастков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеИспользовать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Использовать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОпределяетсяНастройкамиПомещения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПравилаСозданияЗаданийНаОтборРазмещение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ПравилаСозданияЗаданийНаОтборРазмещение</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПодпиткаЗонБыстрогоОтбора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеПоПравиламРазмещенияОбособленныхТоваров</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/НастройкиАдресныхСкладов/Forms/ФормаНастроекСозданияЗаданийНаПеремещение/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Склад = Параметры.Склад;
	Помещение = Параметры.Помещение;
	
	ЕдиницаИзмеренияВеса   = Константы.ЕдиницаИзмеренияВеса.Получить();
	ЕдиницаИзмеренияОбъема = Константы.ЕдиницаИзмеренияОбъема.Получить();
	
	ДействиеНадРегламентнымЗаданием = "";
	Параметры.Свойство("ДействиеНадРегламентнымЗаданием", ДействиеНадРегламентнымЗаданием);
	
	Если ДействиеНадРегламентнымЗаданием = "СоздатьЗадания" Тогда
		Элементы.ГруппаПараметрыРегламентногоЗадания.Видимость = Ложь;
		Элементы.СоздатьЗадания.Заголовок = НСтр("ru = 'Создать задания'");
	Иначе
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, 
			"НаименованиеРегламентногоЗадания, РасписаниеРегламентногоЗадания,
			|ПриОшибкахПовторятьРегламентноеЗадание, ПриОшибкахПовторятьЧерезРегламентноеЗадание
			|");
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.НастройкиСозданияПеремещений, 
			"НастройкаФормированияПоРабочимУчасткам, ОграничениеПоВесу,
			|ОграничениеПоОбъему, ОграничиватьПоВесу, ОграничиватьПоОбъему, 
			|ПравилоСозданияЗаданий, РабочийУчасток
			|");
	КонецЕсли;
		
	ИспользованиеРабочихУчастков = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Склад, "ИспользованиеРабочихУчастков");
	Если ИспользованиеРабочихУчастков = Перечисления.ИспользованиеСкладскихРабочихУчастков.ОпределяетсяНастройкамиПомещения Тогда
		ИспользованиеРабочихУчастков = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Помещение, "ИспользованиеРабочихУчастков");
	КонецЕсли;

	УстановитьЗначенияРеквизитовПоУмолчанию(
		ИспользованиеРабочихУчастков = Перечисления.ИспользованиеСкладскихРабочихУчастков.Использовать);
	Элементы.НастройкиСозданияЗаданийРабочиеУчастки.Видимость = 
		ИспользованиеРабочихУчастков = Перечисления.ИспользованиеСкладскихРабочихУчастков.Использовать;
		
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьОбособленноеОбеспечениеЗаказов") Тогда
		Элементы.ГруппаПравилоСозданияЗаданийВыбор.Видимость = Ложь;
		Элементы.ГруппаПравилоСозданияЗаданийПодпитка.Видимость = Истина;
		АвтоЗаголовок = Ложь;
		Заголовок = НСтр("ru = 'Создание заданий на подпитку зон быстрого отбора'");
	КонецЕсли;
	
	УстановитьДоступность(ЭтаФорма);
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОграничиватьПоВесуПриИзменении(Элемент)
	Элементы.ОграничениеПоВесу.Доступность = ОграничиватьПоВесу;
КонецПроцедуры

&НаКлиенте
Процедура ОграничиватьПоОбъемуПриИзменении(Элемент)
	Элементы.ОграничениеПоОбъему.Доступность = ОграничиватьПоОбъему;
КонецПроцедуры

&НаКлиенте
Процедура НастройкаФормированияПоРабочимУчасткамПриИзменении(Элемент)
	Если НастройкаФормированияПоРабочимУчасткам = "ПоОдномуРабочемуУчастку"
		И ЗначениеЗаполнено(РабочийУчасток) Тогда
		РабочийУчастокПриИзмененииСервер();
	КонецЕсли;
	УстановитьДоступность(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПравилоСозданияЗаданийПриИзменении(Элемент)
	НаименованиеРегламентногоЗадания = СгенерироватьНаименованиеРегламентногоЗадания(Склад, Помещение, ПравилоСозданияЗаданий);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьЗадания(Команда)
	ОчиститьСообщения();
	Если Не ПроверитьЗаполнение() Тогда 
		Возврат
	КонецЕсли;
	
	ПараметрыСоздания = Новый Структура;
	ПараметрыСоздания.Вставить("Помещение",								Помещение);
	ПараметрыСоздания.Вставить("Склад",									Склад);
	ПараметрыСоздания.Вставить("ПравилоСозданияЗаданий",				ПравилоСозданияЗаданий);
	ПараметрыСоздания.Вставить("НастройкаФормированияПоРабочимУчасткам",НастройкаФормированияПоРабочимУчасткам);
	ПараметрыСоздания.Вставить("РабочийУчасток",						РабочийУчасток);
	ПараметрыСоздания.Вставить("ОграничиватьПоВесу",					ОграничиватьПоВесу);
	ПараметрыСоздания.Вставить("ОграничениеПоВесу",						ОграничениеПоВесу);
	ПараметрыСоздания.Вставить("ОграничиватьПоОбъему",					ОграничиватьПоОбъему);
	ПараметрыСоздания.Вставить("ОграничениеПоОбъему",					ОграничениеПоОбъему);
		
	Результат = Новый Структура("ДействиеНадРегламентнымЗаданием, НаименованиеРегламентногоЗадания, ПриОшибкахПовторятьРегламентноеЗадание,
					|ПриОшибкахПовторятьЧерезРегламентноеЗадание, РасписаниеРегламентногоЗадания");
	ЗаполнитьЗначенияСвойств(Результат, ЭтотОбъект);
	Результат.Вставить("Действие", "ЗакрытьИСохранитьРегламентноеЗадание");
	Результат.Вставить("НастройкиСозданияПеремещений", ПараметрыСоздания);
	Закрыть(Результат);
		
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть(Новый Структура("Действие", "Отмена"));
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Прочее

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступность(Форма)
	
	Форма.Элементы.РабочийУчасток.Доступность 				= Форма.НастройкаФормированияПоРабочимУчасткам = "ПоОдномуРабочемуУчастку";
	Форма.Элементы.ОграничениеПоОбъему.Доступность 			= Форма.ОграничиватьПоОбъему;
	Форма.Элементы.ЕдиницаИзмеренияОбъема.Доступность 		= Форма.ОграничиватьПоОбъему;
	Форма.Элементы.ОграничениеПоВесу.Доступность			= Форма.ОграничиватьПоВесу;
	Форма.Элементы.ЕдиницаИзмеренияВеса.Доступность			= Форма.ОграничиватьПоВесу;
	
	Если Форма.НастройкаФормированияПоРабочимУчасткам = "СРазбиениемПоРабочимУчасткам" Тогда
		Форма.Элементы.ГруппаНастройкиОграничения.ТекущаяСтраница = Форма.Элементы.СтраницаОграничиватьНадпись;
	Иначе
		Форма.Элементы.ГруппаНастройкиОграничения.ТекущаяСтраница = Форма.Элементы.СтраницаОграничиватьФлаги;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасписаниеРегламентногоЗаданияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДиалогРасписания = Новый ДиалогРасписанияРегламентногоЗадания(РасписаниеРегламентногоЗадания);
	Оповещение = Новый ОписаниеОповещения("РасписаниеРегламентногоЗаданияНажатиеЗавершение", ЭтаФорма);
	ДиалогРасписания.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура РасписаниеРегламентногоЗаданияНажатиеЗавершение(Расписание, ДополнительныеПараметры) Экспорт
	
	Если Расписание = Неопределено ИЛИ НЕ ТипЗнч(Расписание) = Тип("РасписаниеРегламентногоЗадания") Тогда
		Возврат;
	КонецЕсли;
	
	РасписаниеРегламентногоЗадания = Расписание;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если НастройкаФормированияПоРабочимУчасткам <> "ПоОдномуРабочемуУчастку" Тогда
		МассивНепроверяемыхРеквизитов.Добавить("РабочийУчасток");	
	КонецЕсли;
	
	Если Не ОграничиватьПоВесу Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ОграничениеПоВесу");	
	КонецЕсли;
	
	Если Не ОграничиватьПоОбъему Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ОграничениеПоОбъему");	
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

&НаСервере
Процедура РабочийУчастокПриИзмененииСервер()
		
	ЗаполнитьЗначенияСвойств(
		ЭтаФорма, 
		ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			РабочийУчасток,
			"ОграничиватьПоВесу,ОграничениеПоВесу,ОграничиватьПоОбъему,ОграничениеПоОбъему"),
		"ОграничиватьПоВесу,ОграничениеПоВесу,ОграничиватьПоОбъему,ОграничениеПоОбъему");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначенияРеквизитовПоУмолчанию(ИспользоватьРабочиеУчастки)
	
	Если НЕ ЗначениеЗаполнено(НастройкаФормированияПоРабочимУчасткам) 
		Или Не ИспользоватьРабочиеУчастки Тогда
		НастройкаФормированияПоРабочимУчасткам = "БезРазбиенияПоРабочимУчасткам";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПравилоСозданияЗаданий) Или Не ПолучитьФункциональнуюОпцию("ИспользоватьОбособленноеОбеспечениеЗаказов") Тогда
		ПравилоСозданияЗаданий = Перечисления.ПравилаСозданияЗаданийНаОтборРазмещение.ПодпиткаЗонБыстрогоОтбора;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НаименованиеРегламентногоЗадания) Тогда
		НаименованиеРегламентногоЗадания = СгенерироватьНаименованиеРегламентногоЗадания(Склад, Помещение, ПравилоСозданияЗаданий);
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция СгенерироватьНаименованиеРегламентногоЗадания(Склад, Помещение, ПравилоСозданияЗаданий)
	
	НаименованиеРегламентногоЗадания = 
		НСтр("ru = 'Создание заданий на перемещение ""%Правило%"" для склада ""%ПредставлениеСклада%""'");
	НаименованиеРегламентногоЗадания = 
		СтрЗаменить(НаименованиеРегламентногоЗадания, 
			"%Правило%", 
			СформироватьНаименованиеПравилаДляРегЗадания(ПравилоСозданияЗаданий));
	НаименованиеРегламентногоЗадания = 
		СтрЗаменить(НаименованиеРегламентногоЗадания, 
			"%ПредставлениеСклада%", 
			СкладыСервер.ПолучитьПредставлениеСклада(Склад, Помещение));
			
	Возврат НаименованиеРегламентногоЗадания;

КонецФункции

&НаСервереБезКонтекста
Функция СформироватьНаименованиеПравилаДляРегЗадания(ПравилоСозданияЗаданий)
	Если ПравилоСозданияЗаданий = 
		Перечисления.ПравилаСозданияЗаданийНаОтборРазмещение.ПеремещениеПоПравиламРазмещенияОбособленныхТоваров Тогда
		Возврат НСтр("ru = 'Размещение обособленных товаров'");
	ИначеЕсли ПравилоСозданияЗаданий = 
		Перечисления.ПравилаСозданияЗаданийНаОтборРазмещение.ПодпиткаЗонБыстрогоОтбора Тогда
		Возврат НСтр("ru = 'Подпитка зон быстрого отбора'");
	КонецЕсли;
	Возврат "";
КонецФункции

#КонецОбласти

#КонецОбласти
